In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df.head()

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [13]:
p4 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
d4 = pd.DataFrame([p4], index=['Store 4'])
df.append(d4)

           0  Cost Item Purchased   Name
Store 1  NaN  22.5       Dog Food  Chris
Store 1  NaN   2.5   Kitty Litter  Kevyn
Store 2  NaN   5.0      Bird Seed  Vinod
Store 4  NaN   NaN            NaN    NaN